// エントリポイントファイル main.ts
// -------------------------------------------------------------------------
// 基本モジュールのインポート
// -------------------------------------------------------------------------
import Vue from "vue";
import App from "@/App.vue";

// -------------------------------------------------------------------------
// 外部プラグインのインポート
// -------------------------------------------------------------------------
import { vuetify } from "@/plugins/vuetify";
import { router } from "@/router";
import { store } from "@/store";

// -------------------------------------------------------------------------
// グローバルCSSのインポート
// -------------------------------------------------------------------------
import "@mdi/font/css/materialdesignicons.css";

Vue.config.productionTip = false;

// Vueインスタンス生成
new Vue({
  router,
  vuetify,
  store,
  render: (h) => h(App),
}).$mount("#app");
