// -------------------------------------------------------------------------
// Vueのインポート
// -------------------------------------------------------------------------
import Vue from "vue";

// -------------------------------------------------------------------------
// ライブラリのインポート
// -------------------------------------------------------------------------
import Vuex from "vuex";

// -------------------------------------------------------------------------
// ユーザモジュールのインポート
// -------------------------------------------------------------------------
import { getters } from "@/store/getters";
import { user } from "@/store/modules/user";

// 使用宣言(Vueプロジェクト全体で使用する機能(プラグイン)の宣言)
Vue.use(Vuex);

// インスタンス生成
export const store = new Vuex.Store({
  modules: {
    user,
  },
  getters: getters,
});
